In [1]:
import pandas as pd

In [2]:
pakistan_wheather = pd.DataFrame({
    'city' : ['Karachi', 'Lahore', 'Islamabad'],
    'humidity': [60, 90, 80],
    'Temperature' : [32, 18, 48]
})
pakistan_wheather

        city  humidity  Temperature
0    Karachi        60           32
1     Lahore        90           18
2  Islamabad        80           48

In [3]:
India_wheather = pd.DataFrame({
    'city' : ['Mumbai', 'Dehli', 'UP'],
    'humidity': [80, 60, 40],
    'Temperature' : [42, 28, 41]
})
India_wheather

     city  humidity  Temperature
0  Mumbai        80           42
1   Dehli        60           28
2      UP        40           41

In [7]:
df = pd.concat([pakistan_wheather, India_wheather], ignore_index=True)
df

        city  humidity  Temperature
0    Karachi        60           32
1     Lahore        90           18
2  Islamabad        80           48
3     Mumbai        80           42
4      Dehli        60           28
5         UP        40           41

In [10]:
new_df = pd.concat([pakistan_wheather, India_wheather], keys=['Pakistan', 'India'])
new_df

                 city  humidity  Temperature
Pakistan 0    Karachi        60           32
         1     Lahore        90           18
         2  Islamabad        80           48
India    0     Mumbai        80           42
         1      Dehli        60           28
         2         UP        40           41

In [12]:
temperature_df = pd.DataFrame({
   'city' : ['Karachi', 'Lahore', 'Islamabad'],
   'Temperature' : [32, 18, 48] 
})
temperature_df

        city  Temperature
0    Karachi           32
1     Lahore           18
2  Islamabad           48

In [13]:
windspeed_df = pd.DataFrame({
    'city' : ['Karachi', 'Lahore', 'Islamabad'],
   'Windspeed' : [72, 28, 68] 
})
windspeed_df

        city  Windspeed
0    Karachi         72
1     Lahore         28
2  Islamabad         68

In [16]:
normal_df = pd.concat([temperature_df, windspeed_df], axis=1)
normal_df

        city  Temperature       city  Windspeed
0    Karachi           32    Karachi         72
1     Lahore           18     Lahore         28
2  Islamabad           48  Islamabad         68

In [19]:
s = pd.Series(['Winter', 'Sunny', 'Rain'], name='event')
s

0    Winter
1     Sunny
2      Rain
Name: event, dtype: object

In [21]:
final_df = pd.concat([pakistan_wheather, s] ,axis=1)
final_df

        city  humidity  Temperature   event
0    Karachi        60           32  Winter
1     Lahore        90           18   Sunny
2  Islamabad        80           48    Rain